resources/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-20 Fri 11:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>resources</title>
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" href="/css/style.css">
<link rel="icon" type="image/png" href="https://unluckylisp.com/favicon.png">
<link rel="alternate" type="application/atom+xml" href="/blog/index.atom" title="wizard book (atom)">
<meta name="fediverse:creator" content="@wizardbook@mastodon.social">
<link rel="me" href="https://mastodon.social/@wizardbook" />
<meta property="og:title" content="unluckylisp">
<meta property="og:description" content="A site about wizards and programming.">
<meta property="og:url" content="https://unluckylisp.com/">
<meta property="og:type" content="website">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="unluckylisp">
<meta name="twitter:description" content="A site about wizards and programming.">
</head>
<body>
<div id="content" class="content">
<div class="pixel-frame">
<header class="main-header">
  <a href="/" class="header-logo"></a>
</header>
<h2>resources</h2>

<div class="outline-text-2">
This is a collection of resources throughout the web.</div>

<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#pokemon">Pokemon</a></li>
<li><a href="#ygo">Yu-Gi-Oh</a></li>
<li><a href="#games">Online Board Games / Fun</a></li>
<li><a href="#nippon">Nipponese communities</a></li>
<li><a href="#programming-manuals">Programming manuals/books</a></li>
<li><a href="#friends">Friends</a></li>
</ul>
</div>
<div id="outline-container-pokemon" class="outline-2">
<h2 id="pokemon">Pokemon</h2>
<div class="outline-text-2" id="text-pokemon">
<ul class="org-ul">
<li>News/info<br />
<ul class="org-ul">
<li>serebii.net<br />
<a href="https://serebii.net/">https://serebii.net/</a><br />
<b>custom serebii.net rss feed</b><br />
<a href="https://unluckylisp.com/projects/serebii/serebii.xml">https://unluckylisp.com/projects/serebii/serebii.xml</a><br /></li>
<li>bulbapedia news<br />
<a href="https://bulbagarden.net/home/">https://bulbagarden.net/home/</a><br /></li>
<li>bulbapedia wiki<br />
<a href="https://bulbapedia.bulbagarden.net/wiki/Main_Page">https://bulbapedia.bulbagarden.net/wiki/Main_Page</a><br /></li>
</ul></li>

<li>cool sites / blogs<br />
<ul class="org-ul">
<li>cave of dragonflies<br />
<a href="https://www.dragonflycave.com/">https://www.dragonflycave.com/</a><br />
gen I capture mechanics<br />
<a href="https://www.dragonflycave.com/mechanics/gen-i-capturing/">https://www.dragonflycave.com/mechanics/gen-i-capturing/</a><br /></li>
<li>lyra made a website<br />
<a href="https://lyra-made-a.website/">https://lyra-made-a.website/</a><br /></li>
<li>gen II headbutt tracker<br />
<a href="https://www.tshadowknight.com/Headbutt%20Grid.htm">https://www.tshadowknight.com/Headbutt%20Grid.htm</a><br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-ygo" class="outline-2">
<h2 id="ygo">Yu-Gi-Oh</h2>
<div class="outline-text-2" id="text-ygo">
<p>
hit me up on chat and we can play<br />
</p>

<ul class="org-ul">
<li>Clients<br />
<ul class="org-ul">
<li>ygo pro client (linux/windows/mac/android/ios)<br />
<a href="https://ygopro.org/downloads/">https://ygopro.org/downloads/</a><br /></li>
<li>edopro client (linux/windows/mac/android)<br />
<a href="https://projectignis.github.io/">https://projectignis.github.io/</a><br /></li>
</ul></li>

<li>yugioh card databases<br />
<ul class="org-ul">
<li>best database<br />
<a href="https://ygoprodeck.com/">https://ygoprodeck.com/</a><br /></li>
<li>releases<br />
<a href="https://www.yugioh-card.com/en/">https://www.yugioh-card.com/en/</a><br /></li>
<li>pack database (image)<br />
<a href="https://ygoprodeck.com/packs/">https://ygoprodeck.com/packs/</a><br /></li>
<li>pack database (text)<br />
<a href="https://www.db.yugioh-card.com/yugiohdb/card_list.action">https://www.db.yugioh-card.com/yugiohdb/card_list.action</a><br /></li>
<li>pack sim<br />
<a href="https://ygoprodeck.com/pack-sim/">https://ygoprodeck.com/pack-sim/</a><br /></li>
<li>top decks<br />
<a href="https://www.yugiohmeta.com/top-decks">https://www.yugiohmeta.com/top-decks</a><br /></li>
<li>Battle Pack 1-3<br />
<a href="https://ygoprodeck.com/pack/Battle%20Pack%3A%20Epic%20Dawn">https://ygoprodeck.com/pack/Battle%20Pack%3A%20Epic%20Dawn</a><br />
<a href="https://ygoprodeck.com/pack/Battle%20Pack%202%3A%20War%20of%20the%20Giants">https://ygoprodeck.com/pack/Battle%20Pack%202%3A%20War%20of%20the%20Giants</a><br />
<a href="https://ygoprodeck.com/pack/Battle%20Pack%203:%20Monster%20League">https://ygoprodeck.com/pack/Battle%20Pack%203:%20Monster%20League</a><br />
MR2, common cards we make decks with<br /></li>
</ul></li>

<li>formats<br />
<ul class="org-ul">
<li>edison format<br />
<a href="https://www.edisonformat.com/">https://www.edisonformat.com/</a><br />
<ul class="org-ul">
<li>simulator for edison format<br />
<a href="https://edisonformat.net/beginners/simulators">https://edisonformat.net/beginners/simulators</a><br /></li>
</ul></li>
<li>goat format<br />
<a href="https://www.goatformat.com/">https://www.goatformat.com/</a><br /></li>
<li>all format library<br />
<a href="https://formatlibrary.com/formats/">https://formatlibrary.com/formats/</a><br /></li>
</ul></li>

<li>utils / other<br />
<ul class="org-ul">
<li>Easy deck builder<br />
<a href="https://ygoprodeck.com/master-duel/arena/">https://ygoprodeck.com/master-duel/arena/</a><br /></li>
<li>deck sharing<br />
<a href="https://decks.ygoresources.com/">https://decks.ygoresources.com/</a><br /></li>
<li>general info<br />
<a href="https://yugipedia.com/wiki/Yugipedia">https://yugipedia.com/wiki/Yugipedia</a><br /></li>
<li>history of yugioh cards yt playlist<br />
<a href="https://www.youtube.com/playlist?list=PLpAqSYsFkgvsOKDAAEzj4dCIAfFjwtY0y">https://www.youtube.com/playlist?list=PLpAqSYsFkgvsOKDAAEzj4dCIAfFjwtY0y</a><br /></li>
<li>other fun links<br />
<a href="https://yugioh.fandom.com/wiki/Sealed_Format">https://yugioh.fandom.com/wiki/Sealed_Format</a><br />
<a href="https://yugioh.fandom.com/wiki/Sneak_Peek">https://yugioh.fandom.com/wiki/Sneak_Peek</a><br />
<a href="https://yugioh.fandom.com/wiki/Draft_Format">https://yugioh.fandom.com/wiki/Draft_Format</a><br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-games" class="outline-2">
<h2 id="games">Online Board Games / Fun</h2>
<div class="outline-text-2" id="text-games">
<ul class="org-ul">
<li>lichess.org<br />
<a href="https://lichess.org/">https://lichess.org/</a><br />
I prefer playing chess here. user is ametzner. better to just contact me elsewhere and we setup a game there.<br /></li>
</ul>


<ul class="org-ul">
<li>bgammon.org<br />
<a href="https://play.bgammon.org/">https://play.bgammon.org/</a><br />
Free and open-source backgammon. Guests allowed / no login required.<br /></li>
</ul>


<ul class="org-ul">
<li>tenhou.net (riichi mahjong client)<br />
<a href="https://tenhou.net/">https://tenhou.net/</a><br />
<i>Basically mahjong like a yakuza</i><br />
<ul class="org-ul">
<li>Recommended readings<br />
<ul class="org-ul">
<li>Mahjong resources<br />
<a href="https://mahjong.ie/mahjong-resources/">https://mahjong.ie/mahjong-resources/</a><br /></li>
<li>Not a Japanese speaker?<br />
You can get an extension to translate tenhou web client:<br />
<a href="https://mahjong.ie/tenhou/">https://mahjong.ie/tenhou/</a><br /></li>
</ul></li>
</ul></li>
</ul>


<ul class="org-ul">
<li>skribbl.io<br />
<a href="https://skribbl.io/">https://skribbl.io/</a><br />
Basically pictionary. Allows custom words. No sign up needed to play.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-nippon" class="outline-2">
<h2 id="nippon">Nipponese communities</h2>
<div class="outline-text-2" id="text-nippon">
<p>
Nipponese is a term from Neil Stephenson's "<i>Snow Crash</i>", a classic cyberpunk novel. It was really ahead of its time. Nipponese, for me, is a better alternative term to the popular terms otaku or weeaboo.<br />
</p>

<ul class="org-ul">
<li>gikopoipoi<br />
<a href="https://gikopoipoi.net">https://gikopoipoi.net</a><br />
<ul class="org-ul">
<li><i>"like gikopoi"</i> Successor to the original Japanese flash chatgame Gikopoi.<br /></li>
<li>There are streaming rooms. (public &amp; private)<br /></li>
<li>Active Japanese and Foreign servers.<br /></li>
<li>Name &amp; preferred room: <code>◆wizardTREQ</code> in <i>Hacker's Office</i> (<i>_for</i>). My presence is sporadic, but I like this place to stream with friends sometimes.<br /></li>
</ul></li>
</ul>


<ul class="org-ul">
<li>gikopoi.com<br />
<a href="https://gikopoi.com">https://gikopoi.com</a><br />
<ul class="org-ul">
<li>alt poi, like poipoi, but with custom characters and maps (also websockets / bot friendly)<br /></li>
<li>primarily international, EFL/ESL crowds<br /></li>
<li>I am known as <code>Akai◆giko//JRnk</code>, but I also log in as <code>◆wizardTREQ</code>.<br />
<i>Proud to have been a member of this international super structure staff at one point.</i><br /></li>
</ul></li>
</ul>


<ul class="org-ul">
<li>Flying Cube Technology<br />
<a href="https://flyingcube.tech">https://flyingcube.tech</a><br />
<ul class="org-ul">
<li>Pleroma &amp; matrix host, primarily federating/centered Nipponese-related content<br /></li>
</ul></li>
</ul>


<ul class="org-ul">
<li>Sageru -The unholy citadel of 6ch-<br />
<a href="https://sageru.org/">https://sageru.org/</a><br />
🐝🐝🐝🐝🐝🐝🐝🐝🐝🐝🐝🐝<br />
<a href="https://sageru.org/irc/">https://sageru.org/irc/</a><br />
irc.sageru.org/6697 #jp<br /></li>

<li>paperchan club<br />
<a href="https://paperchan.club/">https://paperchan.club/</a><br />
Anonymous drawing/image-board inspired by pictochat and 4chan<br /></li>
</ul>
</div>
</div>
<div id="outline-container-programming-manuals" class="outline-2">
<h2 id="programming-manuals">Programming manuals/books</h2>
<div class="outline-text-2" id="text-programming-manuals">
<ul class="org-ul">
<li>Structure and Interpretation of Computer Programs (MIT)<br />
<a href="https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/index.html">https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/index.html</a><br /></li>
<li>GNU Emacs manual<br />
<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/index.html">https://www.gnu.org/software/emacs/manual/html_node/emacs/index.html</a><br /></li>
<li>Emacs-Lisp manual<br />
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/index.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/index.html</a><br /></li>
</ul>
</div>
</div>
<div id="outline-container-friends" class="outline-2">
<h2 id="friends">Friends</h2>
<div class="outline-text-2" id="text-friends">
<p>
ma peeps :3<br />
</p>

<ul class="org-ul">
<li>4x13<br />
<a href="https://4x13.net">https://4x13.net</a><br /></li>
<li>Art by Ringo<br />
<a href="https://ringoart.com">https://ringoart.com</a><br /></li>
<li>icy (Under construction)<br />
<a href="https://n0.pw/">https://n0.pw/</a><br /></li>
<li>killsushi (txt/imgboard archiver/historian)<br />
<a href="https://14get.helioho.st/">https://14get.helioho.st/</a><br /></li>
<li>meltingwax<br />
<a href="https://meltingwax.net/">https://meltingwax.net/</a><br /></li>
<li>vulonkaaz<br />
<a href="https://vulonkaaz.zip">https://vulonkaaz.zip</a><br /></li>
<li>zergling<br />
<a href="http://rakka.au/">http://rakka.au/</a><br /></li>
<li>zoomy<br />
<a href="https://temple-moss.neocities.org/">https://temple-moss.neocities.org/</a><br /></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Last modified: 2026-03-20 Fri 11:00</p>
       <p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.7.32)</p>
</div>
</body>
</html>
